app/helpers.php

    function twoFactorGlobalEnabled(): bool
    {
        return Configuracion::first()?->doble_factor_autenticacion ?? false;
---
select * from `configuracion` limit 1