app/Http/Controllers/CatalogoController.php

select * from `categorias` limit 3 offset 0
select count(*) as aggregate from `categorias`
select * from `catalogos` limit 10 offset 0
select * from `categorias` where `categorias`.`id` in (1, 3, 4)
select count(*) as aggregate from `catalogos`
---
    public function index(Request $request)
    {
        $breadcrumb = [
            ['name' => 'Inicio', 'url' => route('home')],
            ['name' => 'Catalogo', 'url' => route('catalogos.index')],
        ];
        $categorias = Categoria::paginate(3, ['*'], 'categorias');

        $search = $request->get('search');


        $catalogos = Catalogo::with('categoria')
            ->when($search, function ($query, $search) {
                return $query->where('catalogo_codigo', 'like', "%{$search}%")
                    ->orWhere('catalogo_descripcion', 'like', "%{$search}%")
                    ->orWhereHas('categoria', function ($query) use ($search) {
                        $query->where('nombre', 'like', "%{$search}%");
                    });
            })
            ->paginate(10);

select * from `categorias`
---
    public function create()
    {
        $breadcrumb = [
            ['name' => 'Inicio', 'url' => route('home')],
            ['name' => 'Catalogo', 'url' => route('catalogos.index')],
            ['name' => 'Crear Catalogo', 'url' => route('catalogos.index')],

        ];
        $categorias = Categoria::all();