app/Http/Controllers/CorreoController.php

    public function index()
    {
        $emails = PlantillaCorreo::all();
        $variablesPlantilla = VariablesPlantillas::all();
---
select * from `plantilla_correos`
select * from `variables_plantillas`