app/Http/Controllers/MenuController.php

select * from `menus` limit 10 offset 0
select count(*) as aggregate from `menus`
---
    public function index()
    {
        $breadcrumb = [
            ['name' => 'Inicio', 'url' => route('home')],
            ['name' => 'Menus', 'url' => route('menus.index')],
        ];

        $secciones = Seccion::paginate(10);

        $menus = Menu::with('seccion')->paginate(10);