app/Http/Controllers/SeccionController.php

    public function SugerirIcono(Request $request)
    {
        $titulo = $request->input('titulo');
        $conf = Configuracion::first();
---
select * from `configuracion` limit 1