app/Http/Controllers/UserController.php

select * from `users` limit 5 offset 0
select count(*) as aggregate from `users`
---
    public function index()
    {
        $users = User::paginate(5); // Trae todos los usuarios